In [1]:
import numpy as np
import pandas as pd

In [2]:
titanic = pd.read_csv('titanic.csv')#打开titanic.csv文件

In [3]:
titanic.head()#查看前5条

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
len(titanic)#统计一共多少条数据

891

In [19]:
titanic['survived'].value_counts()#统计survived列

0    549
1    342
Name: survived, dtype: int64

In [20]:
len(titanic[titanic['survived'] == 1])#统计survived列数值为一的个数，第一节课讲过

342

In [21]:
titanic['survived'].mean()#计算survived的平均值，也就是生存率

0.3838383838383838

In [53]:
titanic.groupby('sex')['survived'].aggregate('mean')#计算以sex为索引，survived列的平均值，既男女生存率

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [44]:
titanic.groupby('sex')['survived'].sum()/titanic.groupby('sex')['survived'].count()#同上

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [49]:
titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()#统计1，2，3等舱男女获救比例

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

#### Pivot Table Syntax数据透视表

#### 1.基本用法

##### pandas.pivot_table(data,values=None,index=None,columns=None,addfunc='mean')

In [67]:
pd.pivot_table(titanic,values='survived',index='sex',columns='class')#比groupby操作更加简单

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [68]:
titanic.pivot_table('survived',index='sex',columns='class',aggfunc='mean')#同上,aggfunc默认是mean

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [69]:
titanic.pivot_table('survived',index='sex',columns='class',aggfunc='count')#统计各种舱男女人数

class   First  Second  Third
sex
female     94      76    144
male      122     108    347

#### 2.多列数据，复杂条件聚合

In [71]:
titanic.pivot_table(index='sex',columns='class',aggfunc={'survived':'sum','fare':'mean'})#在aggfunc中以字典形式标出聚合对象及方式

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

#### 3.margins参数应用

In [84]:
titanic.pivot_table(index='sex',columns='class',aggfunc={'survived':'mean','fare':'mean'},margins=False)#默认关闭，字典形式aggfunc不可用

              fare                        survived
class        First     Second      Third     First    Second     Third
sex
female  106.125798  21.970121  16.118810  0.968085  0.921053  0.500000
male     67.226127  19.741782  12.661633  0.368852  0.157407  0.135447

In [85]:
titanic.pivot_table('survived',index='sex',columns='class',margins=True,margins_name='total')

class      First    Second     Third     total
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
total   0.629630  0.472826  0.242363  0.383838